---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LinearArray
source: html/8bd5e8c1-f45a-868c-12c2-b95a539ff983.htm
---
# LinearArray Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.